In [1]:
import pandas as pd 
csn1  = pd.read_csv("submission.csv")

In [20]:
ca = csn1.index
print(ca)

RangeIndex(start=0, stop=1000, step=1)

In [31]:
csn1.columns

Index(['Unnamed: 0', 'Symbol', 'data'], dtype='object')

In [30]:
csn1.head

<bound method NDFrame.head of      Unnamed: 0  Symbol  data
0             0       0     0
1             1       1     1
2             2       2     2
3             3       3     3
4             4       4     4
..          ...     ...   ...
995         995     995   995
996         996     996   996
997         997     997   997
998         998     998   998
999         999     999   999

[1000 rows x 3 columns]>

In [10]:
csn1.head(2)

   Unnamed: 0  data
0           0     0
1           1     1

In [11]:
csn1.tail

<bound method NDFrame.tail of      Unnamed: 0  data
0             0     0
1             1     1
2             2     2
3             3     3
4             4     4
..          ...   ...
995         995   995
996         996   996
997         997   997
998         998   998
999         999   999

[1000 rows x 2 columns]>

In [9]:
csn1.tail(2)

     Unnamed: 0  data
998         998   998
999         999   999

In [14]:
csn1[60:82]

    Unnamed: 0  data
60          60    60
61          61    61
62          62    62
63          63    63
64          64    64
65          65    65
66          66    66
67          67    67
68          68    68
69          69    69
70          70    70
71          71    71
72          72    72
73          73    73
74          74    74
75          75    75
76          76    76
77          77    77
78          78    78
79          79    79
80          80    80
81          81    81

In [16]:
csn1[:]

     Unnamed: 0  data
0             0     0
1             1     1
2             2     2
3             3     3
4             4     4
..          ...   ...
995         995   995
996         996   996
997         997   997
998         998   998
999         999   999

[1000 rows x 2 columns]

In [19]:
csr = csn1.index.array
csr

<NumpyExtensionArray>
[  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
 ...
 990, 991, 992, 993, 994, 995, 996, 997, 998, 999]
Length: 1000, dtype: int64

In [23]:
csnm = csn1.to_numpy
print(csnm)
print(type(csnm))

<bound method DataFrame.to_numpy of      Unnamed: 0  data
0             0     0
1             1     1
2             2     2
3             3     3
4             4     4
..          ...   ...
995         995   995
996         996   996
997         997   997
998         998   998
999         999   999

[1000 rows x 2 columns]>
<class 'method'>

In [25]:
import numpy as np
method2 = np.asarray(csn1)

In [27]:
desn = csn1.sort_index(axis=0,ascending=False)
desn

     Unnamed: 0  data
999         999   999
998         998   998
997         997   997
996         996   996
995         995   995
..          ...   ...
4             4     4
3             3     3
2             2     2
1             1     1
0             0     0

[1000 rows x 2 columns]

In [29]:
csn1.insert(1,"Symbol",csn1["data"])

In [35]:
csn1["Symbol"][0]="python"
csn1.head()

   Unnamed: 0  Symbol  data
0           0  python     0
1           1       1     1
2           2       2     2
3           3       3     3
4           4       4     4

In [36]:
csn1.loc[1,"Symbol"] = "PyThOn"
csn1.head()

   Unnamed: 0  Symbol  data
0           0  python     0
1           1  PyThOn     1
2           2       2     2
3           3       3     3
4           4       4     4

In [38]:
csn1.insert(2,"Security",csn1["data"])

In [39]:
csn1.head()

   Unnamed: 0  Symbol  Security  data
0           0  python         0     0
1           1  PyThOn         1     1
2           2       2         2     2
3           3       3         3     3
4           4       4         4     4

In [40]:
csn1.loc[[2,3],["Symbol","Security"]]

  Symbol  Security
2      2         2
3      3         3

In [47]:
csn1.iloc[0,1]

'python'

In [48]:
csn1.iloc[1,1]

'PyThOn'

In [49]:
csn1.loc[3,"Security"]="Nigga"

C:\Users\User\AppData\Local\Temp\ipykernel_18836\3292090252.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Nigga' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  csn1.loc[3,"Security"]="Nigga"

In [50]:
csn1.head()

   Unnamed: 0  Symbol Security  data
0           0  python        0     0
1           1  PyThOn        1     1
2           2       2        2     2
3           3       3    Nigga     3
4           4       4        4     4

In [52]:
csn1.iloc[3,2]

'Nigga'

In [53]:
csn1.drop("Security",axis=1)

     Unnamed: 0  Symbol  data
0             0  python     0
1             1  PyThOn     1
2             2       2     2
3             3       3     3
4             4       4     4
..          ...     ...   ...
995         995     995   995
996         996     996   996
997         997     997   997
998         998     998   998
999         999     999   999

[1000 rows x 3 columns]

In [54]:
csn1.drop(0,axis=0)

     Unnamed: 0  Symbol Security  data
1             1  PyThOn        1     1
2             2       2        2     2
3             3       3    Nigga     3
4             4       4        4     4
5             5       5        5     5
..          ...     ...      ...   ...
995         995     995      995   995
996         996     996      996   996
997         997     997      997   997
998         998     998      998   998
999         999     999      999   999

[999 rows x 4 columns]